[
  {
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/f1a773a0-f131-415a-9677-93e8ad1ee87e",
    "company": "Novo Nordisk A/S",
    "company_url": "https://www.novonordisk.com/careers/professionals/it/digital-accelerator.html",
    "location": "Copenhagen, Denmark",
    "title": "Software Developers - front- & back-end",
    "description": "<p><em>Looking to make real impact? Look no further.</em></p> <p>The Digital Accelerator in Novo Nordisk continues to grow, and we are looking for the next software developer to join our team. If you become part of our journey, you can build a better future with your own two hands. By utilising your passion, skills, and knowledge about the latest digital technologies you can challenge the status quo and develop digital solutions with the aim of solving complex business challenges and deliver value to the company and our 29.000.000+ patients globally.</p> <p><strong>About the department</strong></p> <p>The Digital Accelerator is the home of the Outliers - a team of people who are wired differently. We are anchored in Digital Incubator &amp; Innovation unit in Global IT.</p> <p>Our purpose is to a drive cultural change through partnering with the business to accelerate digital innovation. We aim to do this by providing passionate people, new ways of working, and the technical foundation to help solve Novo Nordisk business challenges. In order to add most value, our people are 100% dedicated and co-located together with product teams that are comprised of business and IT colleagues.</p> <p>The department is growing fast, and the people in the Digital Accelerator are working hard to develop the best digital solutions and ensure high impact. However, we see our workplace as a space for learning and experimentation, and make sure to leave room for trying out new ideas and having fun while we drive meaningful change.</p> <p><strong>The job</strong></p> <p>As our next software developer, you will shape and implement technology as well as business solutions to deliver value to the users in various business areas, ultimately addressing some of the biggest business opportunities we have in Novo Nordisk. You’ll have a chance to immerse yourself into not only the tech, but also understand the ins and out of the business challenge as you engage with the team members as well as internal stakeholders to shape the best solutions.</p> <p>Your main responsibility will be to build value-driving and innovative digital solutions from the ground up, and explore new technologies and tools to apply during the development of these solutions. As a technology choice, we are primarily using the Microsoft stack, and are focused on building full end-to-end digital solution leveraging cloud and CI/CD pipelines. Teams works agile through the SCRUM method, and your day to day work will be involved in iterating on the product backlog in close alignment with the Product Owner. As we are pioneering the digital transformation of Novo Nordisk, we expect you to challenge and inspire the organisation as well as take part in establishing a strong internal community to share knowledge and learnings.</p> <p><strong>Qualifications</strong></p> <p>We are currently looking to fill several software developer positions, both on the front-end and back-end, where different skills and competencies are required. You are expected to come with a strong understanding and hands-on experience with broad software development and SaaS principles along with object-oriented design and programming skills. Since our use-cases extend across the value chain of Novo Nordisk (R&amp;D, Manufacturing, Commercial), having a “T-profile” wherein you specialise within either the front- or back-end, while still having an understanding and curiosity about other domains, would be a significant asset.</p> <p>Platform &amp; Process:</p> <ul> <li>Microsoft Azure</li> <li>PaaS services &amp; Serverless Computing</li> <li>CI/CD Pipelines using Azure DevOps</li> <li>SCRUM method supported by Azure DevOps</li> <li>TDD, BDD, Automated Unit Testing</li> <li>Object Oriented Design and SOLID principles</li> <li>Visual Studio 2019, Visual Studio Code, Azure DevOps Repositories/Git</li> </ul> <p>Back-End:</p> <ul> <li>Microsoft Technology Stack - .NET Core, ASP.NET Core, C#, Azure</li> <li>Event-driven and micro-service architectures</li> <li>Security and Authentication – OAuth, Azure AD</li> <li>REST based API development – JSON, XML</li> <li>SQL Server / T-SQL</li> <li>NoSQL databases like Cosmos DB</li> <li>Experience within PaaS/serverless services in Azure</li> <li>Azure Functions, Event Hub, Service Bus, Data Factory, SignalR</li> </ul> <p>Front-End:</p> <ul> <li>Vue.js or similar SPA frameworks - React, Angular</li> <li>JavaScript, HTML/CSS</li> <li>Flutter or similar cross platform mobile development</li> <li>Xamarin/.NET/C# platform for corporate mobile development</li> </ul> <p>Most importantly though is having the right mind-set which is open to learning and applying new skills within greenfield software development. Overall, we expect our new colleagues to be team players, curious, eager to learn and drive change. As our corporate language is English, we expect you to be fluent both in writing and spoken. It is a plus if you have experience with integrating to various system of records within a corporate environment using different protocols, or have previous experience working in a regulated environment (e.g. pharma, aviation, finance).</p> <p><strong>Contact</strong></p> <p>For further information, please contact hiring manager Sonya Frey at +45 3075 6853 / <a href=\"mailto:syf@novonordisk.com\">syf@novonordisk.com</a>.</p> <p>Deadline: 26 April 2020</p> ",
    "how_to_apply": "<p>Apple via our Job Portal here: <a href=\"https://www.novonordisk.com/careers/working-at-novo-nordisk/job-ad-display.28781.en_GB.html\">https://www.novonordisk.com/careers/working-at-novo-nordisk/job-ad-display.28781.en_GB.html</a></p> <p>Questions: email <a href=\"mailto:syf@novonordisk.com\">syf@novonordisk.com</a></p> ",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVNDIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5aebd47a52197a779964e8c025f82be0e845369c/apis%20bull%20Novo%20Nordisk.png"
  },
  {
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/a6ec7302-239b-4149-be8c-8817509c827e",
    "company": "PwC",
    "company_url": "http:",
    "location": "Amsterdam",
    "title": "Front End Developer",
    "description": "<h2>Welcome to PwC’s Experience Center</h2> <p>As part of an international community of creators, makers and innovators you drive the business of PwC’s digital services from our Experience Center. In cross-functional teams, you design and build innovative solutions for our clients to thrive in the ‘experience age’.</p> <p>Many of our clients face significant challenges - expectations of their customers and employees change faster than they can adapt. At the same time, new market entrants cause significant disruption, and steal market share away. To tackle these challenges, our clients require a partner that can help them innovate and accelerate the implementation of solutions that have an immediate and differentiating impact on the experience provided to their customer or employees.</p> <p>The Experience Center is part of a multinational European team, closely collaborating with colleagues across offices in Amsterdam, Brussels, Paris, Frankfurt, Berlin and Stockholm to name a few.</p> <p>For more information about the Experience Center take a look on the following page.</p> <h2><em>Who are you?</em></h2> <p>To have a differentiating impact on our clients’ customers and their employees, you will be user-centric in your thinking and approach. You are passionate about designing delightful experiences for humans, to empower and enable them.</p> <p>You know how to effectively work in cross-functional, agile teams. You are a digital native, creative in everything you do, you are confident, and you dare to challenge the status quo.</p> <p>We would love to hear from you if you meet most of the following expectations:</p> <ul> <li>You have multiple years of experience in software development and you love to code;</li> <li>You’ve been doing responsive web development for years and have an eye for great UI / UX design;</li> <li>You have a lot of experience working with frontend technologies like HTML, CSS and JavaScript;</li> <li>You have worked with CSS preprocessors like Sass/SCSS and understand CSS naming conventions;</li> <li>You work with modern frontend tools and follow industry standard best practices;</li> <li>You have knowledge programming using modern JavaScript/ES and frameworks like React;</li> <li>You are comfortable working within a node.js environment;</li> <li>You have managed code repositories using Git version control;</li> <li>You bring an agile mind-set, you are interested in learning to work with CI/CD, Docker;</li> <li>You have a proactive, goal-oriented, reliable and self-structured way of working;</li> <li>You are a team player, are open-minded, and are highly engaged and invested. You love to learn and try-out new technologies.</li> </ul> <h2><em>What do we offer?</em></h2> <p>Working at PwC means working with a range of customers and inspirational colleagues under extensive employment conditions that have been put together with due consideration for your future growth and a flexible approach to work and life. You will be part of a fast growing and high performing team. We invest heavily in our teams and individuals, and help you develop deep specialist capabilities. Most importantly, we offer you the freedom to pursue your passion, and have an impact on the life of others. Some of our key employee benefits include:</p> <ul> <li>You’ll be part of an international consulting firm where people are lead by its values and inspired by our purpose;</li> <li>An open and collaborative working atmosphere, where we encourage everyone to provide and receive feedback;</li> <li>A knowledge-drive organization where you can learn from, and grow into, a top specialist;</li> <li>Flexible working arrangements;</li> <li>You’ll get great training opportunities;</li> <li>The opportunity to contribute to Corporate Responsibility, diversity, innovation and / or recruitment;</li> <li>Multicultural team with a strong growth ambition;</li> <li>A lot of coaching and an eye for your personal development;</li> <li>Excellent primary and secondary employment conditions, including Macbook, iPhone;</li> </ul> <h2>Apply now!</h2> <p>Are you interested in this vacancy and do you meet the requirements? Apply directly by clicking the <a href=\"https://vonq.io/2wWdKq8\">this link!</a></p> ",
    "how_to_apply": "<p><a href=\"https://vonq.io/2wWdKq8\">Click here to apply!</a></p> ",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaDJDIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--50811fc061c474af63e330cecb3816fa715049ff/PWC.jpeg"
  },
  {
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/e589561e-9d19-49eb-9501-c907601094e3",
    "company": "Bending Spoons",
    "company_url": "https://bendingspoons.com/index.html",
    "location": "Our HQ is in downtown Milan, but you'll be working from the comfort of your home.",
    "title": "Android Engineer, Remote",
    "description": "<p>With tens of millions of active users and hundreds of thousands of daily downloads, we’re Europe’s leading iOS app developer. Now we’re setting our sights on taking the Play Store by storm. With a new frontier to conquer, we’re looking for a passionate, talented, and experienced native Android Developer eager to join the Android team to help migrate our app portfolio remotely.</p> <p>A few examples of your responsibilities:</p> <p>*Migrate our portfolio of world-renowned iOS apps to the most recent Android version, making them available to a whole new user base.</p> <p>*Contribute to the product development of the apps you’ll work on. We’re all about taking a proactive role and ownership of your work.</p> <p>*Help define the software architecture of entire apps or new features—and then develop them. The work spans a broad range, from engineering and coding features, to polishing world-class user interfaces.</p> <p>*Constantly improve the quality of our products by fixing bugs and refactoring the code base where necessary, as well as adding that WOW factor to put a smile on our users’ faces.</p> <p>*Stay up to speed with new technologies (particularly on Android), and test the promising ones to make sure we don’t miss out on game-changing opportunities.</p> <p>What We Offer</p> <p>*Huge impact. You’ll be working on apps used by millions of people all around the world. The quality of your work will make a decisive difference—both to the users and to Bending Spoons as a whole.</p> <p>*Talented, knowledgeable colleagues. You’ll get the chance to learn from—and teach —some of the brightest and most skilled people you’ll ever meet. Your talent is going to blossom here.</p> <p>*Cool tech stack. We strive to use the best, most modern tools and technologies, and when they fall short of our expectations we invent our own. It’s a geek’s paradise.</p> <p>*Own products. We don’t work for clients—we only develop our own apps. Freed from client-provider politics, we can move fast and be daring.</p> <p>*International reach. Our audience is truly international. Our company language is English. We’re a global force and your work will have worldwide exposure.</p> <p>What We Look For</p> <p>*Passion for the topic. You have a long-standing, proven passion for developing native Android apps.</p> <p>*Reasoning and depth of learning. You’re structured and creative enough to solve most challenging problems independently, given the necessary knowledge. You learn new concepts and skills rapidly, and love to nerd out and go in-depth.</p> <p>*Drive. You’re energetic, hard-working, and persevere through adversity until the job is done—and done well. You’re massively into getting results, and always aim for excellence in what you do.</p> <p>*Curiosity and initiative. You love exploring and you’re entrepreneurial in seeking out new opportunities and testing ideas of your own accord. You seek—you don’t just wait to be told what to do.</p> <p>*A knack for UX and attention to detail. You care about developing quality user experiences, and notice the details that make a difference. You get a kick out of making a UI or an animation just perfect.</p> <p>*Diligence, organization. You can be entrusted with responsibilities big and small.</p> <p>*Humility. You’re down to earth, eager to listen to feedback and constructive criticism, and ready to get your hands dirty with whatever the team needs to succeed.</p> <p>*Proficient in English. You read, write, and speak fluently in English.</p> <p>*Availability. We work 9-6 GMT+1. Our schedule is flexible, but we prefer to work together most of the time. That’s why you should live somewhere with a similar timezone—between GMT-2 and GMT+3.</p> <p>Commitment &amp; Contract: Full-time, permanent (tempo indeterminato).</p> <p>Location: Our HQ is in downtown Milan, but you'll be working from the comfort of your home.</p> <p>Compensation &amp; Benefits: Generous, top of market, and moreover can grow very rapidly and include stock options, depending on performance. You’ll receive the latest Mac, iPhone, and wireless noise-canceling Bose headset, as well as any software you might need to perform at your best.</p> <p>IMPORTANT</p> <p>Please notice that only applications submitted through our website will be considered. Apply here: <a href=\"https://bndspn.com/2z48C3O\">https://bndspn.com/2z48C3O</a></p> ",
    "how_to_apply": "<p>Please notice that only applications submitted through our website will be considered. Apply here: <a href=\"https://bndspn.com/2z48C3O\">https://bndspn.com/2z48C3O</a></p>",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaE9DIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f7c6a129e27540a321738e2324353927ac13891b/Bending%20Spoons%20-%20Logo,%20black.png"
  },
  {
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/45286ff4-35d8-4eb5-b7f1-cd9fe5842a55",
    "company": "Target Corporation",
    "company_url": "https://corporate.target.com/Careers?ref=sr_shorturl_careers",
    "location": "7000 Target Parkway North, Brooklyn Park, Minnesota",
    "title": "Principal Engineer - Data Center Strategy",
    "description": "<p>About us:</p> <p>Target is an iconic brand, a Fortune 50 company and one of America’s leading retailers.</p> <p>Target as a tech company? Absolutely. We’re the behind-the-scenes powerhouse that fuels Target’s passion and commitment to cutting-edge innovation. We anchor every facet of one of the world’s best-loved retailers with a strong technology framework that relies on the latest tools and technologies—and the brightest people—to deliver incredible value to guests online and in stores. Target Technology Services is on a mission to offer the systems, tools and support that guests and team members need and deserve. Our high-performing teams balance independence with collaboration, and we pride ourselves on being versatile, agile and creative. We drive industry-leading technologies in support of every angle of the business, and help ensure that Target operates smoothly, securely and reliably from the inside out.</p> <p>Use your skills, experience and talents to be a part of groundbreaking thinking and visionary goals. As a Principal Engineer, you’ll take the lead as you…</p> <p>Understand Target's business and technical environments and assist teams in resolving complex business challenges via current technical solutions by assessing viability/applicability/cost implication through POCs and prototypes. Collaborate with technical staff and Enterprise Architecture teams in setting technical direction across platform and drive technology lifecycle management and communication of standards/decisions to the engineering team. Participate in procurement specifications, installation, and maintenance of Target systems. Lead designing and building the Target platform API with deep focus on non-functional requirement including scalability, availability, performance, etc while being a strong advocate of extreme agile and DevOps practices across engineers. Work with engineering leaders to build a high performing engineering team and provide technical leadership, coaching, motivation and participate in the selection of technical talent.</p> <p>Core responsibilities of this job are described within this job description. Job duties may change at any time due to business needs.</p> <p>About you:</p> <ul> <li>4 year degree or equivalent experience. Continuing education to maintain thorough knowledge of technical domains along with staying current in latest technologies</li> <li>12+ years of experience in technology development or services</li> <li>4+ years of experience in strategic planning and setting technical direction</li> <li>Possesses a strong understanding of systems programming and control languages as required by your domain. Has demonstrated success in solving complex technical problems in more than one technical or functional areas</li> <li>Understands business fundamentals and how technologies can support business goals along with how to translate business vision into a technical strategy while understanding the financial implications</li> <li>Has proven leadership capabilities, the ability to influence others, interpersonal skills, and problem solving skills</li> <li>Strong team player who understands concepts of teamwork and team effectiveness.</li> <li>Has excellent verbal, written, and presentation communication skills to convey complex technical solutions clearly to an organization</li> <li>Has excellent planning and organizational skills.</li> <li>Experience in Java/ J2EE, sql/ no-sql (postgre, mongoDB, Cassandra, graph structure, etc), Python, Ruby, Chef, Drone, Kubernetes containers, Cloud tech, etc.</li> </ul> <p>Top of the stack:</p> <p>Java, Go, Python, Load Balancing, Geo-graphic Load Balancing, Service Mesh concepts, DNS</p> <p>Middle of the stack:</p> <p>Skills in Network Backbone routing, BGP, BGP-EVPN, DNS, CI/CD pipelines, practicing Infra as Code, Service Mesh/Routing such as Envoy or Istio, Python, Java, Go, Load Balancing, Geo-graphic Load Balancing,</p> <p>Lower Stack Focus:</p> <p>Broad range of skills in Data Center Facilities Management</p> <p>Americans with Disabilities Act (ADA)</p> <p>Target will provide reasonable accommodations (such as a qualified sign language interpreter or other personal assistance) with the application process upon your request as required to comply with applicable laws. If you have a disability and require assistance in this application process, please visit your nearest Target store or Distribution Center or reach out to Guest Services at 1-800-440-0680 for additional information.</p> ",
    "how_to_apply": "<p>Apply Now!</p> <p><a href=\"https://tgt.biz/r0000064861\">https://tgt.biz/r0000064861</a></p> ",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ3VDIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--374eb20ed6a49696c9f52d9da8348c69d4a81f31/BullseyeTransparent_2500px.png"
  },
  {
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/c5eb9947-beb5-4ec2-aa09-58f2fd86d2dd",
    "company": "Target Corporation",
    "company_url": "https://corporate.target.com/Careers?ref=sr_shorturl_careers",
    "location": "Minneapolis, Minnesota",
    "title": "Lead Engineer",
    "description": "<p>About us: Target is an iconic brand, a Fortune 50 company and one of America’s leading retailers.</p> <p>Target as a tech company? Absolutely. We’re the behind-the-scenes powerhouse that fuels Target’s passion and commitment to cutting-edge innovation. We anchor every facet of one of the world’s best-loved retailers with a strong technology framework that relies on the latest tools and technologies—and the brightest people—to deliver incredible value to guests online and in stores. Target Technology Services is on a mission to offer the systems, tools and support that guests and team members need and deserve. Our high-performing teams balance independence with collaboration, and we pride ourselves on being versatile, agile and creative. We drive industry-leading technologies in support of every angle of the business, and help ensure that Target operates smoothly, securely and reliably from the inside out.</p> <p>As a Lead Engineer on the Warehousing team, you will work towards building and operating the software that enables automation at various stages within Target’s warehousing facilities to enable product movement to stores and guest order fulfillment. This team builds software that leverages robotics, IoT, messaging frameworks and cutting-edge elastic computing to move products within the warehouse. These teams build greenfield event-based micro-services that breakdown the work into the smallest components to enable extreme flexibility.</p> <p>We are looking for engineers to build innovative and well-designed software and also be a part of groundbreaking technological innovation, strategic thinking and visionary goals. As a Lead Engineer in the Warehouse product team, you will:</p> <ul> <li>Be a significant code contributor, own and be accountable for your work, drive best practices and ensure the development of high-quality code.</li> <li>Be a great team player, mentor team members and help build a team of high caliber software development engineers</li> <li>Drive resolution of technology roadblocks including code, infrastructure, build and deployment</li> <li>Advocate for technologies, frameworks, design patterns, processes and guiding values of the domain architecture</li> <li>Ensure all code adheres to all development &amp; security standards</li> </ul> <p>About you:</p> <ul> <li>4 year degree or equivalent experience</li> <li>7+ years of software development experience with at least one full cycle implementation</li> <li>Demonstrates strong domain-specific knowledge regarding Target’s technology capabilities, and key competitors’ products and differentiating features</li> <li>Demonstrates broad and deep expertise in multiple computer languages and frameworks (e.g., open source). Designs, develops, and approves end-to-end functionality of a product line, platform, or infrastructure</li> <li>Communicates and coordinates with project team, partners, and stakeholders</li> <li>Demonstrates expertise in analysis and optimization of systems capacity, performance, and operational health</li> <li>Understands and develops solutions to foster data life cycle management</li> <li>Maintains deep technical knowledge within areas of expertise</li> <li>Stays current with new and evolving technologies via formal training and self-directed education</li> <li>Experience in building highly scalable distributed systems</li> </ul> <p>Americans with Disabilities Act (ADA)</p> <p>Target will provide reasonable accommodations (such as a qualified sign language interpreter or other personal assistance) with the application process upon your request as required to comply with applicable laws. If you have a disability and require assistance in this application process, please visit your nearest Target store or Distribution Center or reach out to Guest Services at 1-800-440-0680 for additional information.</p> ",
    "how_to_apply": "<p>Apply Now!</p> <p><a href=\"https://tgt.biz/r0000060460GH\">https://tgt.biz/r0000060460GH</a></p> ",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ2lDIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a6c59195be3b5e266df24227e592d2ae5eadf75a/BullseyeTransparent_2500px.png"
  },
  {
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/0ee643e6-6b70-43e7-a07f-f6d37d11b3b8",
    "company": "Capmo GmbH ",
    "company_url": "https://www.capmo.de/",
    "location": "Munich",
    "title": "Mobile Developer React Native (m/f/d)",
    "description": "<p>Capmo writes software for the construction industry. There are 10 million construction workers in Europe alone - and globally construction was a 14 trillion industry last year. 1 out of 10 people in the world eats, sleeps and breath construction every day. We believe that the hardest working people in the world also deserve great software to do their jobs. No matter if it is to renovate a private home or to build a hospital - We want to help realize great projects you can be proud of!</p> <p>We are a bunch of fun, interdisciplinary, and international people striving to become the leading digital solution for the construction industry.</p> <p><strong>Tasks</strong></p> <p>As Mobile Developer React Native (m/f/d) you take an active role in shaping our great Android and iOS apps. If you are passionate about working on a product impacting thousands of construction projects every day, strive to build high-quality software and like to work in an agile and interdisciplinary team, this is the place for you!</p> <p><em>These challenges are waiting for you:</em></p> <ul> <li>Build pixel-perfect, buttery smooth UIs across both mobile platforms</li> <li>Implement and improve innovative features for our Android and iOS apps such as voice input</li> <li>Build an offline-first app that works even in the deepest basement</li> <li>Create an app that is so intuitive to use that it is suited even for the rough environment on construction sites</li> <li>Work on a product where web and mobile apps are integrated in the same workflows</li> </ul> <p><strong>Requirements</strong></p> <p>You strive in a cross-functional, dynamic and demanding work environment and already gathered first experience as part of agile software development teams.</p> <ul> <li>You love recompose, styled-components, Ramda and WatermelonDB as much as we do - You believe that great code requires proper formatting with prettier, linting with eslint and testing with jest - otherwise you don't commit.</li> <li>You care about building great products for customers as much as about building great software - You are willing to leave code and processes in a better shape than when you first encountered them</li> <li>You are a person who loves to share your knowledge and learnings with the team</li> <li>You take ownership for the code you write; you don’t believe in throwing code over the wall, but instead see development, testing, deployment, and debugging as your tasks</li> <li>Strong written and spoken English (level C1) and willing to relocate to Munich - German is not required.</li> </ul> <p><strong>Benefits</strong></p> <ul> <li>State of the art tech stack using React in the frontend and NodeJS in the backend hosted on AWS. Our mobile app is built in React Native with WatermelonDB as a client side database that is synchronised with the backend for offline availability (full tech stack here)</li> <li>Your chance to actively shape a rapidly growing startup backed by leading European VCs and users who keep the app on their home screen</li> <li>Work in cross-functional teams with product and development colleagues to enable projects such as solar parks and new apartment buildings</li> <li>Permanent contract</li> <li>Support for going to tech conferences and taking speaking engagements (1.500€ development budget per year)</li> <li>Flexible working hours, home office, central office space as well as 25 vacation days and 13 public holidays</li> <li>MacBook Pro and your choice of other hardware such as Bose noise canceling headphones</li> <li>Relocation allowance, language course and visa sponsorship</li> <li>Regular team events, e.g. Isar-Rafting, Krimirallye, Lasertag &amp; Hut tours</li> </ul> ",
    "how_to_apply": "<p><a href=\"https://capmo.join.com/jobs/934819-mobile-developer-react-native-m-f-d?pid=629cde9f588365c10a90&amp;utm_source=linkedin&amp;utm_medium=paid&amp;utm_campaign=tech%2Bperformance%2Bpackage&amp;utm_content=mobile%2Bdeveloper%2Breact%2Bnative%2Bm%2Bf%2Bd\">https://capmo.join.com/jobs/934819-mobile-developer-react-native-m-f-d?pid=629cde9f588365c10a90&amp;utm_source=linkedin&amp;utm_medium=paid&amp;utm_campaign=tech%2Bperformance%2Bpackage&amp;utm_content=mobile%2Bdeveloper%2Breact%2Bnative%2Bm%2Bf%2Bd</a></p> ",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdUtCIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4237be3c26291f9f1e3ad6c2bfebd80c0d9e4785/CAPMO-Logo-1%20(1).png"
  },
  {
    "type": "Contract",
    "url": "https://jobs.github.com/positions/46d4783d-6032-4e47-a485-336b2c6d2a35",
    "company": "Signature Creative Inc.",
    "company_url": null,
    "location": "Los Angeles",
    "title": "Wordpress Developer",
    "description": "<p><strong>Who We Are</strong></p> <p>Established in 2004, Signature Creative is a full-service agency helping startups, rising companies and Fortune 500 businesses successfully launch products from concept to commercialization. For 14 years, Signature Creative has been an innovation leader in the product and digital development landscapes working with a diverse mix of global clients.</p> <p><strong>The Role</strong></p> <p>Signature Creative is looking for an experienced Web Developer to work across its expanding portfolio of clients. The ideal candidate will have solid back-end and front-end development experience, as well as skilled in responsive design. You will work across a variety of clients within entertainment, music, technology and more. This role requires a seasoned leader, someone who can drive multiple projects and manage staff. You are a proven self-starter with ability to work independently in a fast-paced environment. You are an innovative thinker, providing new ideas and consistently offering innovative solutions.</p> <p><strong>Core Duties/Responsibilities</strong></p> <ul> <li>Leading WordPress projects, from scoping and strategy all the way through building and supporting, large and complex WordPress sites.</li> <li>Expert in Plugin Development</li> <li>Extensive experience and knowledge in running Wordpress as Docker Container</li> <li>Expert in performance optimization (caching, etc.)</li> <li>Experience and knowledge of security related aspects</li> <li>Experience in Authorization and Authentication – (eg- OAUTH2)</li> <li>Deep experience in Wordpress APIs and headless design experience is preferred</li> <li>Collaborating with design and front-end engineering teams to ensure effectiveness and quality</li> <li>Taking part in our code review process (both reviewing the work of other developers and having your own work reviewed)</li> <li>Working with project managers to come up with creative and effective solutions to our client's problems</li> </ul> <p><strong>What We're looking for</strong></p> <ul> <li>Extensive hands on experience in CMS development, with a strong focus on WordPress</li> <li>Hands on experience with Wordpress, CSS, Javascript, HTML5 and PHP</li> <li>Experience building and maintaining custom WordPress Plugins</li> <li>A working knowledge of git</li> <li>Building websites using WordPress and other open source software</li> <li>Being an expert problem solver and technical innovator, and an ability to identify, understand, and implement viable new technologies.</li> <li>Excellent communication skills</li> <li>server-side JS development, like node.js</li> <li>Have experience with object oriented programming</li> <li>Have experience with agile workflows</li> <li>Have experience with automated testing</li> <li>Convert UI/UX designs and mocks to functional, custom themes in Wordpress</li> <li>Excellent troubleshooting skills - CSS, Layouts, graphics etc. - cross browser compatible</li> </ul> ",
    "how_to_apply": "<p>APPLY HERE <a href=\"https://forms.gle/mKk69CVfnkQ4cQFu7\">https://forms.gle/mKk69CVfnkQ4cQFu7</a></p> ",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdDZCIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--627dc92753170ca2203e78e24b11422d573bbef1/blue-690x550.jpg"
  },
  {
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/90cc0d62-ebfa-482a-a195-59afeb958000",
    "company": "Clockwork Trading",
    "company_url": "https://thehub.io/startups/clockwork-trading",
    "location": "Copenhagen",
    "title": "Tech Lead",
    "description": "<p>Clockwork is a startup revolutionizing the investment experience by offering a user-centered platform with innovative user interface and user experience. We’re not like any existing financial solution. On our app users can invest into a broad universe including the most exciting tech stocks and leading cryptocurrencies on a gamified platform that simplifies insight and decision-making. We’re all about making investing easily accessible to the many and not only to the few.</p> <p>NB, we're about to change our name, identity, website, etc. as part of a rebranding process.</p> <p>Opportunity</p> <p>Do you want to rethink and build the innovative millennial investment platform? Would you like to make a big difference for a lot of people? As our Tech Lead, you’ll be forward-looking in conceptualizing and implementing new secure systems for our innovative investment application. You’ll work with a wide focus on optimizing agile development processes. You and the dev team will take the technical responsibility for a highly efficient and secure investment platform.</p> <p>Profile</p> <ul> <li>Desirably a degree in Computer Science, Engineering, Mathematics or equivalent, but not required.</li> <li>Sound fundamentals in problem-solving, algorithm design and system design.</li> <li>Experience with cloud computing (AWS).</li> <li>Languages/Syntax: Experience in either C# or Python, and SQL. Understanding of Node.js, React Native, and Typescript is desirable.</li> <li>Familiar with Git or CodeCommit for version control.</li> <li>Preferably knowledge of working with big data financial systems, but not required.</li> </ul> <p>The Role</p> <p>Imagine creating the absolutely best investment experience. Bring passion and dedication to your work and there's no limitation to what you could accomplish. We’re looking for a Tech Lead who can lead and collaborate with backend-, blockchain-, and frontend engineers as well as data scientists on performance, functionality, and automation to enhance the user experience.</p> <p>This role requires you as a candidate to own the quality of the code you write, with tests that keep the codebase in check to ensure the platform is rock solid. You’ll contribute to the long-term engineering excellence of the Clockwork systems including designing, implementing and reviewing new APIs. We look for someone who is driven to solve problems with new ideas and take action to bring them to life.</p> <p>Team</p> <p>As a team, we value people, fun, disruption, transparency, intuitiveness, and excellence. People are important to us, which means social activities both with the team itself and together with the users. We’re building a creative environment with the freedom to innovate. Ambition is a must as we’re enjoying disrupting a legacy industry.</p> <p>Our stack</p> <p>Server Architecture: Lambda, EC2, Elastic Beanstalk. API Service: Rest and Websocket through API Gateway. Microservices: AWS Microservices. Relational Database: AWS RDS, Aurora, MySQL.</p> <p>Formalities</p> <p>Our office is at the Symbion co-working space in Østerbro, Copenhagen, Denmark, which means you’ll be working in a vibrant and highly creative atmosphere.</p> <p>The Tech Lead role comes with the opportunity of gaining equity. We offer flexible working hours and the opportunity to work from home as well as free coffee, tea, office snacks, and gym access.</p> <p>If you have any questions regarding the position, please contact Rasmus Koch Nielsen by mail.</p> <p>Clockwork is an equal opportunity employer. We offer employment opportunities to members of all backgrounds, perspectives, and abilities. We’re counting six employees and six different nationalities.</p> ",
    "how_to_apply": "<p>Email <a href=\"mailto:rkn@clockworktrader.com\">rkn@clockworktrader.com</a></p> <p>Or apply here <a href=\"https://thehub.io/jobs/5e8779fe47fffe42bec7ad5f\">https://thehub.io/jobs/5e8779fe47fffe42bec7ad5f</a></p> ",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdFNCIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6919a58d69127f4c5519a46592d004b8d6a2cb6b/Clockwork-logo-rgb-squared.jpg"
  }
]
